tesaiot/tesaiot-pse84-devkit-sdk/micropython-psoc-edge-psoc-edge-main/ports/psoc-edge/boards/KIT_PSE84_AI/mpconfigboard.h
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2022-2025 Infineon Technologies AG
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

// Board and hardware specific configuration
#ifndef MICROPY_HW_MCU_NAME
#define MICROPY_HW_MCU_NAME                     "PSoC-Edge-E84"
#endif
#ifndef MICROPY_HW_BOARD_NAME
#define MICROPY_HW_BOARD_NAME                   "BENTO KIT_PSE84_AI"
#endif

#ifndef MICROPY_HW_BOARD_SKU
#define MICROPY_HW_BOARD_SKU                    "KIT_PSE84_AI_001"
#endif

#ifndef MICROPY_PY_NETWORK_HOSTNAME_DEFAULT
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT     "KIT_PSE84_AI"
#endif

// External QSPI Flash Configuration
// These sizes are determined by the physical flash chip specifications
// and memory map layout for the KIT_PSE84_AI board
#define MICROPY_PY_EXT_FLASH (1)

// Flash memory map: Total 64MB (0x04000000) QSPI flash (S25HS512T hybrid flash)
// S25HS512T Memory Map:
//   Region 0: 0x000000-0x01FFFF (32 x 4KB sectors)
//   Region 1: 0x020000-0x03FFFF (1 x 128KB sector)
//   Region 2: 0x040000-0x3FFFFFF (255 x 256KB sectors) <- We use this region
//
// !!! The firmware itself EXECUTES-IN-PLACE from this same chip. Per the
// !!! linker maps the declared XIP regions run to 11.75MB (m55_nvm ends
// !!! 0x60B80000, m55_trailer 0x60BC0000) and the linker will place code up
// !!! to there WITHOUT any warning. The old FS base of 9MB sat 2.75MB inside
// !!! that window — safe only while the m55 image stayed under 9MB (it had
// !!! grown to 8.69MB by 2026-07-02, i.e. 0.31MB from silent firmware
// !!! corruption). Same failure class that bricked Eva Kit boards. The FS
// !!! base MUST stay above the declared XIP regions, not just above today's
// !!! image size.
// CRITICAL: Base address MUST be aligned to 256KB (0x40000) sector boundary!
// NOTE: changing this base reformats the filesystem on already-deployed
// boards (LittleFS superblocks move) — warn users that on-board files are
// wiped on first boot after the update.
#define EXT_FLASH_BASE              (0x00C00000)  // 12MB — above all XIP regions (sector 48)

// Usable filesystem space: 64MB - 12MB = 52MB (0x03400000 bytes)
#define EXT_FLASH_SIZE              (0x04000000 - EXT_FLASH_BASE)

// erase sector size : 256KB, fixed by flash chip hardware in Region 2.
#define EXT_FLASH_SECTOR_SIZE        (0x40000)       /** 256KB*/

// Block device block size: Must match erase sector size for proper filesystem operation
#define EXT_FLASH_BLOCK_SIZE_BYTES  (EXT_FLASH_SECTOR_SIZE)

// Program page size: Fixed by flash chip hardware (minimum writable unit). Matches LittleFS write_size.
#define EXT_FLASH_PAGE_SIZE         (0x200) /** 512 Bytes */

// I2C Configuration
#define MICROPY_HW_I2C0_SCB                     (SCB5)
#define MICROPY_HW_I2C0_SCL_PORT                GPIO_PRT17
#define MICROPY_HW_I2C0_SCL_PIN                 P17_0_NUM
#define MICROPY_HW_I2C0_SCL_HSIOM               P17_0_SCB5_I2C_SCL
#define MICROPY_HW_I2C0_SDA_PORT                GPIO_PRT17
#define MICROPY_HW_I2C0_SDA_PIN                 P17_1_NUM
#define MICROPY_HW_I2C0_SDA_HSIOM               P17_1_SCB5_I2C_SDA
#define MICROPY_HW_I2C0_SCL                     (P17_0_NUM)
#define MICROPY_HW_I2C0_SDA                     (P17_1_NUM)
#define MAX_I2C                                 1
#define MICROPY_HW_I2C_INTR_PRIORITY            (7UL)
#define MICROPY_HW_I2C_PCLK                     PCLK_SCB5_CLOCK_SCB_EN
#define MICROPY_HW_I2C_IRQn                     scb_5_interrupt_IRQn
